Merge pull request #6 from KrishnaNsingh/main
Enhance README with TOC, diagrams, and technology stack badges
